{
  "developer": "Développeuse Front-End",
  "header": {
    "navbar": {
      "home": "Home",
      "about": "À propos",
      "portfolio": "Portfolio",
      "contact": "Contact"
    }
  },
  "about": {
    "title": "À propos",
    "subtitle": "Développeuse Front-End basée en région parisienne",
    "content": {
      "welcome": "Bonjour et bienvenue sur mon portfolio.",
      "introduction": "Je me présente, Alexandra Marti-Montessinos, développeuse front-end basée en région parisienne.",
      "background": "J'ai travaillé dans divers domaines tels que l'esthétique et le tourisme. J'ai démarré mes expériences professionnelles au Japon en 2016 et suis rentrée en France en 2020. À cette période, j'ai souhaité tout en passant ma licence de japonais, prendre le temps de déterminer le domaine dans lequel j'aimerais vraiment travailler. J'ai commencé à apprendre par moi-même les bases du développement web puis j'ai continué sur une formation OpenClassrooms en 2023 pour me conforter dans la voie que j'avais choisie.",
      "portfolio": "Retrouvez sur ce portfolio certains projets sur lesquels j'ai travaillé jusqu'à maintenant."
    }
  },
  "accordion": {
    "education": {
      "header": "Formations",
      "body": {
        "licence": "Licence LLCE Japonais",
        "oc": "Intégrateur web, OC"
      }
    },
    "skills": {
      "header": "Compétences"
    },
    "languages": {
      "header": "Langues",
      "body": {
        "french": "Français",
        "french.level": "Langue natale",
        "english": "Anglais",
        "english.level": "Avancé",
        "japanese": "Japonais",
        "japanese.level": "Intermédiaire"
      }
    }
  },
  "project": {
    "dialog": {
      "close": "Fermer"
    },
    "portfolio": {
      "title": "Portfolio",
      "content": "Création de mon site Portfolio avec React, TypeScript et Tailwind.",
      "dialog": {
        "title": "Portfolio",
        "subtitle": "Ce site permet de me présenter et de répertorier une partie de mon travail.",
        "content": "Mon portfolio est responsive et a été développé en React et avec TypeScript. J'ai également décidé de me familiariser avec Tailwind en l'utilisant pour la première fois dans ce projet."
      }
    },
    "argentbank": {
      "title": "ArgentBank",
      "content": "Implémentation du front-end avec React et rédaction de routes à créer pour l'API.",
      "dialog": {
        "title": "ArgentBank [Projet OpenClassrooms]",
        "subtitle": "Argent Bank est une nouvelle banque en ligne.",
        "content": "Je me suis occupée de la mise en place du tableau de bord des utilisateurs de la banque avec React et Redux. J'ai également utilisé TypeScript pour une meilleure documentation du code. J'ai aussi eu l'occasion d'écrire de la documentaion OpenAPI et de déterminer de nouveaux endpoints."
      }
    },
    "kasa": {
      "title": "Kasa",
      "content": "Refonte totale du site Kasa pour passer à une stack React côté front-end.",
      "dialog": {
        "title": "Kasa [Projet OpenClassrooms]",
        "subtitle": "Kasa est une platforme web qui permet la location d'appartements entre particuliers.",
        "content": "Sur ce projet, j'ai pu m'initier à React et aux composants réutilasables. Je me suis également assurée que le site était responsive et que l'intégration respectait bien la maquette."
      }
    },
    "sophiebluel": {
      "title": "Portfolio de Sophie Bluel",
      "content": "Création d'une page web dynamique en JavaScript.",
      "dialog": {
        "title": "Portfolio de Sophie Bluel [Projet OpenClassrooms]",
        "subtitle": "Sophie Bluel est une architecte d'intérieur qui partage son travail sur son site portfolio.",
        "content": "J'ai réalisé l'intégration de la maquette avec HTML et CSS. Afin que la cliente puisse mettre à jour elle-même ses travaux, j'ai utilisé JavaScript."
      }
    },
    "ohmyfood": {
      "title": "Ohmyfood",
      "content": "Amélioration de l'interface du site Ohmyfood avec des animations.",
      "dialog": {
        "title": "Ohmyfood [Projet OpenClassrooms]",
        "subtitle": "Ohmyfood est un site qui répertorie les menus de restaurants gastronomiques et qui permettra par la suite la réservation de son menu.",
        "content": "J'ai réalisé l'intégration de la maquette ainsi que les animations qui étaient souhaitées avec SASS uniquement."
      }
    },
    "booki": {
      "title": "Booki",
      "content": "Intégration statique d'une maquette en HTML et CSS.",
      "dialog": {
        "title": "Booki [Projet OpenClassrooms]",
        "subtitle": "Booki est une agence de voyage et son site permet aux usagers de trouver des hébergements et des activités dans la ville de leur choix.",
        "content": "Je me suis occupée de faire l'intégration en HTML et CSS de la maquette communiquée."
      }
    },
    "events": {
      "title": "724 Events",
      "content": "Déboggage du site 724 Events et rédaction de tests unitaires.",
      "dialog": {
        "title": "724 Events [Projet OpenClassrooms]",
        "subtitle": "724 Events est une agence d'événementiel possédant un site vitrine.",
        "content": "Le premier développeur à avoir travaillé sur le projet a dû abandonner le projet, de ce fait quelques bugs étaient présents. Mon rôle a été de corriger les bugs majeurs. J'ai également corrigé des bugs mineurs qui rendaient l'expérience utilisateur moins agréable. J'ai pu mettre en place des tests unitaires et en corriger certains sur ce projet."
      }
    },
    "ninacarducci": {
      "title": "Nina Carducci",
      "content": "Amélioration du score de l'audit Lighthouse et de l'accessibilité.",
      "dialog": {
        "title": "Portfolio de Nina Carducci [Projet OpenClassrooms]",
        "subtitle": "Nina Carducci est une photographe qui partage son travail sur son site portfolio.",
        "content": "Mon rôle a été d'optimiser le site et de le rendre plus accessible. Pour l'optimisation, j'ai notamment modifié les images et minifié le code. Pour l'accessibilité, j'ai entre autre fait des modifications sur la sémantique HTML, le contraste des couleurs, les attributs. J'ai pu m'aider des outils comme Wave ou Lighthouse."
      }
    }
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Vous souhaitez me contacter ?",
    "content": {
      "mail": "Envoyez-moi un message à",
      "links": "Mes réseaux :"
    }
  }
}
